apache/nuttx/arch/arm/src/sam34/hardware/sam4l_pinmap.h
/************************************************************************************
 * arch/arm/src/sam34/hardware/sam3u_pinmap.h
 *
 *   Copyright (C) 2009-2011, 2013 Gregory Nutt. All rights reserved.
 *   Author: Gregory Nutt <gnutt@nuttx.org>
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name NuttX nor the names of its contributors may be
 *    used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ************************************************************************************/

#ifndef __ARCH_ARM_SRC_SAM34_HARDWARE_SAM3U_PINMAP_H
#define __ARCH_ARM_SRC_SAM34_HARDWARE_SAM3U_PINMAP_H

/************************************************************************************
 * Included Files
 ************************************************************************************/

#include <nuttx/config.h>

#include "chip.h"
#include "sam_gpio.h"

/************************************************************************************
 * Pre-processor Definitions
 ************************************************************************************/
/* Alternate Pin Functions.
 *
 * Alternative pin selections are provided with a numeric suffix like _1, _2, etc.
 * Drivers, however, will use the pin selection without the numeric suffix.
 * Additional definitions are required in the board.h file.  For example, if
 * SPI MSIO connects vis PA21 on some board, then the following definition should
 * appear in the board.h header file for that board:
 *
 * #define GPIO_SPI_MISO GPIO_SPI_MISO_1
 *
 * The driver will then automatically configre PA21 as the SPI MISO pin.
 */

/* WARNING!!! WARNING!!! WARNING!!! WARNING!!! WARNING!!! WARNING!!! WARNING!!!
 * Additional effort is required to select specific GPIO options such as frequency,
 * open-drain/push-pull, and pull-up/down!  Just the basics are defined for most
 * pins in this file.
 */

/*  Audio Bitstream DAC */

#define GPIO_ABDACB_CLK_1     (GPIO_FUNCC | GPIO_PORTA | GPIO_PIN31)
#define GPIO_ABDACB_CLK_2     (GPIO_FUNCC | GPIO_PORTC | GPIO_PIN12)
#define GPIO_ABDACB_DAC0_1    (GPIO_FUNCB | GPIO_PORTA | GPIO_PIN17)
#define GPIO_ABDACB_DAC0_2    (GPIO_FUNCC | GPIO_PORTA | GPIO_PIN27)
#define GPIO_ABDACB_DAC0_3    (GPIO_FUNCC | GPIO_PORTB | GPIO_PIN2)
#define GPIO_ABDACB_DAC0_4    (GPIO_FUNCC | GPIO_PORTC | GPIO_PIN9)
#define GPIO_ABDACB_DAC1_1    (GPIO_FUNCB | GPIO_PORTA | GPIO_PIN19)
#define GPIO_ABDACB_DAC1_2    (GPIO_FUNCC | GPIO_PORTA | GPIO_PIN29)
#define GPIO_ABDACB_DAC1_3    (GPIO_FUNCC | GPIO_PORTB | GPIO_PIN4)
#define GPIO_ABDACB_DAC1_4    (GPIO_FUNCC | GPIO_PORTC | GPIO_PIN13)
#define GPIO_ABDACB_DACN0_1   (GPIO_FUNCB | GPIO_PORTA | GPIO_PIN18)
#define GPIO_ABDACB_DACN0_2   (GPIO_FUNCC | GPIO_PORTA | GPIO_PIN28)
#define GPIO_ABDACB_DACN0_3   (GPIO_FUNCC | GPIO_PORTB | GPIO_PIN3)
#define GPIO_ABDACB_DACN0_4   (GPIO_FUNCC | GPIO_PORTC | GPIO_PIN10)
#define GPIO_ABDACB_DACN1_1   (GPIO_FUNCB | GPIO_PORTA | GPIO_PIN20)
#define GPIO_ABDACB_DACN1_2   (GPIO_FUNCC | GPIO_PORTA | GPIO_PIN30)
#define GPIO_ABDACB_DACN1_3   (GPIO_FUNCC | GPIO_PORTB | GPIO_PIN5)
#define GPIO_ABDACB_DACN1_4   (GPIO_FUNCC | GPIO_PORTC | GPIO_PIN14)

/*  Analog Comparator Interface */

#define GPIO_ACIFC_ACAN0       (GPIO_FUNCE | GPIO_PORTA | GPIO_PIN6)
#define GPIO_ACIFC_ACAN1       (GPIO_FUNCE | GPIO_PORTC | GPIO_PIN9)
#define GPIO_ACIFC_ACAP0       (GPIO_FUNCE | GPIO_PORTA | GPIO_PIN7)
#define GPIO_ACIFC_ACAP1       (GPIO_FUNCE | GPIO_PORTC | GPIO_PIN10)
#define GPIO_ACIFC_ACBN0       (GPIO_FUNCE | GPIO_PORTB | GPIO_PIN2)
#define GPIO_ACIFC_ACBN1       (GPIO_FUNCE | GPIO_PORTC | GPIO_PIN13)
#define GPIO_ACIFC_ACBP0       (GPIO_FUNCE | GPIO_PORTB | GPIO_PIN3)
#define GPIO_ACIFC_ACBP1       (GPIO_FUNCE | GPIO_PORTC | GPIO_PIN14)

/* ADC controller interface  */

#define GPIO_ADCIFE_AD0        (GPIO_FUNCA | GPIO_PORTA | GPIO_PIN4)
#define GPIO_ADCIFE_AD1        (GPIO_FUNCA | GPIO_PORTA | GPIO_PIN5)
#define GPIO_ADCIFE_AD2        (GPIO_FUNCA | GPIO_PORTA | GPIO_PIN7)
#define GPIO_ADCIFE_AD3        (GPIO_FUNCA | GPIO_PORTB | GPIO_PIN2)
#define GPIO_ADCIFE_AD4        (GPIO_FUNCA | GPIO_PORTB | GPIO_PIN3)
#define GPIO_ADCIFE_AD5        (GPIO_FUNCA | GPIO_PORTB | GPIO_PIN4)
#define GPIO_ADCIFE_AD6        (GPIO_FUNCA | GPIO_PORTB | GPIO_PIN5)
#define GPIO_ADCIFE_AD7        (GPIO_FUNCA | GPIO_PORTC | GPIO_PIN7)
#define GPIO_ADCIFE_AD8        (GPIO_FUNCA | GPIO_PORTC | GPIO_PIN8)
#define GPIO_ADCIFE_AD9        (GPIO_FUNCA | GPIO_PORTC | GPIO_PIN9)
#define GPIO_ADCIFE_AD10       (GPIO_FUNCA | GPIO_PORTC | GPIO_PIN10)
#define GPIO_ADCIFE_AD11       (GPIO_FUNCA | GPIO_PORTC | GPIO_PIN11)
#define GPIO_ADCIFE_AD12       (GPIO_FUNCA | GPIO_PORTC | GPIO_PIN12)
#define GPIO_ADCIFE_AD13       (GPIO_FUNCA | GPIO_PORTC | GPIO_PIN13)
#define GPIO_ADCIFE_AD14       (GPIO_FUNCA | GPIO_PORTC | GPIO_PIN14)
#define GPIO_ADCIFE_TRIGGER    (GPIO_FUNCE | GPIO_PORTA | GPIO_PIN5)

/*  Capacitive Touch Module B */

#define GPIO_CATB_DIS_1        (GPIO_FUNCG | GPIO_PORTA | GPIO_PIN12)
#define GPIO_CATB_DIS_2        (GPIO_FUNCG | GPIO_PORTA | GPIO_PIN2)
#define GPIO_CATB_DIS_3        (GPIO_FUNCG | GPIO_PORTA | GPIO_PIN23)
#define GPIO_CATB_DIS_4        (GPIO_FUNCG | GPIO_PORTA | GPIO_PIN31)
#define GPIO_CATB_DIS_5        (GPIO_FUNCG | GPIO_PORTB | GPIO_PIN12)
#define GPIO_CATB_DIS_6        (GPIO_FUNCG | GPIO_PORTB | GPIO_PIN3)
#define GPIO_CATB_DIS_7        (GPIO_FUNCG | GPIO_PORTC | GPIO_PIN14)
#define GPIO_CATB_DIS_8        (GPIO_FUNCG | GPIO_PORTC | GPIO_PIN23)
#define GPIO_CATB_DIS_9        (GPIO_FUNCG | GPIO_PORTC | GPIO_PIN5)
#define GPIO_CATB_SENSE0_1     (GPIO_FUNCG | GPIO_PORTA | GPIO_PIN27)
#define GPIO_CATB_SENSE0_2     (GPIO_FUNCG | GPIO_PORTA | GPIO_PIN4)
#define GPIO_CATB_SENSE0_3     (GPIO_FUNCG | GPIO_PORTB | GPIO_PIN13)
#define GPIO_CATB_SENSE1_1     (GPIO_FUNCG | GPIO_PORTA | GPIO_PIN28)
#define GPIO_CATB_SENSE1_2     (GPIO_FUNCG | GPIO_PORTA | GPIO_PIN5)
#define GPIO_CATB_SENSE1_3     (GPIO_FUNCG | GPIO_PORTB | GPIO_PIN14)
#define GPIO_CATB_SENSE2_1     (GPIO_FUNCG | GPIO_PORTA | GPIO_PIN29)
#define GPIO_CATB_SENSE2_2     (GPIO_FUNCG | GPIO_PORTA | GPIO_PIN6)
#define GPIO_CATB_SENSE2_3     (GPIO_FUNCG | GPIO_PORTB | GPIO_PIN15)
#define GPIO_CATB_SENSE3_1     (GPIO_FUNCG | GPIO_PORTA | GPIO_PIN30)
#define GPIO_CATB_SENSE3_2     (GPIO_FUNCG | GPIO_PORTA | GPIO_PIN7)
#define GPIO_CATB_SENSE3_3     (GPIO_FUNCG | GPIO_PORTC | GPIO_PIN0)
#define GPIO_CATB_SENSE4_1     (GPIO_FUNCG | GPIO_PORTA | GPIO_PIN8)
#define GPIO_CATB_SENSE4_2     (GPIO_FUNCG | GPIO_PORTC | GPIO_PIN1)
#define GPIO_CATB_SENSE5_1     (GPIO_FUNCG | GPIO_PORTA | GPIO_PIN9)
#define GPIO_CATB_SENSE5_2     (GPIO_FUNCG | GPIO_PORTC | GPIO_PIN2)
#define GPIO_CATB_SENSE6_1     (GPIO_FUNCG | GPIO_PORTA | GPIO_PIN10)
#define GPIO_CATB_SENSE6_2     (GPIO_FUNCG | GPIO_PORTC | GPIO_PIN3)
#define GPIO_CATB_SENSE7_1     (GPIO_FUNCG | GPIO_PORTA | GPIO_PIN11)
#define GPIO_CATB_SENSE7_2     (GPIO_FUNCG | GPIO_PORTC | GPIO_PIN4)
#define GPIO_CATB_SENSE8_1     (GPIO_FUNCG | GPIO_PORTA | GPIO_PIN13)
#define GPIO_CATB_SENSE8_2     (GPIO_FUNCG | GPIO_PORTC | GPIO_PIN6)
#define GPIO_CATB_SENSE9_1     (GPIO_FUNCG | GPIO_PORTA | GPIO_PIN14)
#define GPIO_CATB_SENSE9_2     (GPIO_FUNCG | GPIO_PORTC | GPIO_PIN7)
#define GPIO_CATB_SENSE10_1    (GPIO_FUNCG | GPIO_PORTA | GPIO_PIN15)
#define GPIO_CATB_SENSE10_2    (GPIO_FUNCG | GPIO_PORTC | GPIO_PIN8)
#define GPIO_CATB_SENSE11_1    (GPIO_FUNCG | GPIO_PORTA | GPIO_PIN16)
#define GPIO_CATB_SENSE11_2    (GPIO_FUNCG | GPIO_PORTC | GPIO_PIN9)
#define GPIO_CATB_SENSE12_1    (GPIO_FUNCG | GPIO_PORTA | GPIO_PIN17)
#define GPIO_CATB_SENSE12_2    (GPIO_FUNCG | GPIO_PORTC | GPIO_PIN10)
#define GPIO_CATB_SENSE13_1    (GPIO_FUNCG | GPIO_PORTA | GPIO_PIN18)
#define GPIO_CATB_SENSE13_2    (GPIO_FUNCG | GPIO_PORTC | GPIO_PIN11)
#define GPIO_CATB_SENSE14_1    (GPIO_FUNCG | GPIO_PORTA | GPIO_PIN19)
#define GPIO_CATB_SENSE14_2    (GPIO_FUNCG | GPIO_PORTC | GPIO_PIN12)
#define GPIO_CATB_SENSE15_1    (GPIO_FUNCG | GPIO_PORTA | GPIO_PIN20)
#define GPIO_CATB_SENSE15_2    (GPIO_FUNCG | GPIO_PORTC | GPIO_PIN13)
#define GPIO_CATB_SENSE16_1    (GPIO_FUNCG | GPIO_PORTA | GPIO_PIN21)
#define GPIO_CATB_SENSE16_2    (GPIO_FUNCG | GPIO_PORTC | GPIO_PIN15)
#define GPIO_CATB_SENSE17_1    (GPIO_FUNCG | GPIO_PORTA | GPIO_PIN22)
#define GPIO_CATB_SENSE17_2    (GPIO_FUNCG | GPIO_PORTC | GPIO_PIN16)
#define GPIO_CATB_SENSE18_1    (GPIO_FUNCG | GPIO_PORTA | GPIO_PIN24)
#define GPIO_CATB_SENSE18_2    (GPIO_FUNCG | GPIO_PORTC | GPIO_PIN17)
#define GPIO_CATB_SENSE19_1    (GPIO_FUNCG | GPIO_PORTA | GPIO_PIN25)
#define GPIO_CATB_SENSE19_2    (GPIO_FUNCG | GPIO_PORTC | GPIO_PIN18)
#define GPIO_CATB_SENSE20_1    (GPIO_FUNCG | GPIO_PORTA | GPIO_PIN26)
#define GPIO_CATB_SENSE20_2    (GPIO_FUNCG | GPIO_PORTC | GPIO_PIN19)
#define GPIO_CATB_SENSE21_1    (GPIO_FUNCG | GPIO_PORTB | GPIO_PIN0)
#define GPIO_CATB_SENSE21_2    (GPIO_FUNCG | GPIO_PORTC | GPIO_PIN20)
#define GPIO_CATB_SENSE22_1    (GPIO_FUNCG | GPIO_PORTB | GPIO_PIN1)
#define GPIO_CATB_SENSE22_2    (GPIO_FUNCG | GPIO_PORTC | GPIO_PIN21)
#define GPIO_CATB_SENSE23_1    (GPIO_FUNCG | GPIO_PORTB | GPIO_PIN2)
#define GPIO_CATB_SENSE23_2    (GPIO_FUNCG | GPIO_PORTC | GPIO_PIN22)
#define GPIO_CATB_SENSE24_1    (GPIO_FUNCG | GPIO_PORTB | GPIO_PIN4)
#define GPIO_CATB_SENSE24_2    (GPIO_FUNCG | GPIO_PORTC | GPIO_PIN24)
#define GPIO_CATB_SENSE25_1    (GPIO_FUNCG | GPIO_PORTB | GPIO_PIN5)
#define GPIO_CATB_SENSE25_2    (GPIO_FUNCG | GPIO_PORTC | GPIO_PIN25)
#define GPIO_CATB_SENSE26_1    (GPIO_FUNCG | GPIO_PORTB | GPIO_PIN6)
#define GPIO_CATB_SENSE26_2    (GPIO_FUNCG | GPIO_PORTC | GPIO_PIN26)
#define GPIO_CATB_SENSE27_1    (GPIO_FUNCG | GPIO_PORTB | GPIO_PIN7)
#define GPIO_CATB_SENSE27_2    (GPIO_FUNCG | GPIO_PORTC | GPIO_PIN27)
#define GPIO_CATB_SENSE28_1    (GPIO_FUNCG | GPIO_PORTB | GPIO_PIN8)
#define GPIO_CATB_SENSE28_2    (GPIO_FUNCG | GPIO_PORTC | GPIO_PIN28)
#define GPIO_CATB_SENSE29_1    (GPIO_FUNCG | GPIO_PORTB | GPIO_PIN9)
#define GPIO_CATB_SENSE29_2    (GPIO_FUNCG | GPIO_PORTC | GPIO_PIN29)
#define GPIO_CATB_SENSE30_1    (GPIO_FUNCG | GPIO_PORTB | GPIO_PIN10)
#define GPIO_CATB_SENSE30_2    (GPIO_FUNCG | GPIO_PORTC | GPIO_PIN30)
#define GPIO_CATB_SENSE31_1    (GPIO_FUNCG | GPIO_PORTB | GPIO_PIN11)
#define GPIO_CATB_SENSE31_2    (GPIO_FUNCG | GPIO_PORTC | GPIO_PIN31)

