apache/nuttx/arch/arm/src/sam34/hardware/sam4l_pinmap.h
/* DAC Controller */

#define GPIO_DACC_EXT_TRIG0    (GPIO_FUNCE | GPIO_PORTB | GPIO_PIN4)
#define GPIO_DACC_VOUT         (GPIO_FUNCA | GPIO_PORTA | GPIO_PIN6)
#define GPIO_EIC_EXTINT0       (GPIO_FUNCC | GPIO_PORTB | GPIO_PIN1)
#define GPIO_EIC_EXTINT1_1     (GPIO_FUNCB | GPIO_PORTC | GPIO_PIN24)
#define GPIO_EIC_EXTINT1_2     (GPIO_FUNCC | GPIO_PORTA | GPIO_PIN16)
#define GPIO_EIC_EXTINT1_3     (GPIO_FUNCC | GPIO_PORTA | GPIO_PIN6)
#define GPIO_EIC_EXTINT2_1     (GPIO_FUNCB | GPIO_PORTC | GPIO_PIN25)
#define GPIO_EIC_EXTINT2_2     (GPIO_FUNCC | GPIO_PORTA | GPIO_PIN17)
#define GPIO_EIC_EXTINT2_3     (GPIO_FUNCC | GPIO_PORTA | GPIO_PIN4)
#define GPIO_EIC_EXTINT3_1     (GPIO_FUNCB | GPIO_PORTC | GPIO_PIN26)
#define GPIO_EIC_EXTINT3_2     (GPIO_FUNCC | GPIO_PORTA | GPIO_PIN18)
#define GPIO_EIC_EXTINT3_3     (GPIO_FUNCC | GPIO_PORTA | GPIO_PIN5)
#define GPIO_EIC_EXTINT4_1     (GPIO_FUNCB | GPIO_PORTC | GPIO_PIN27)
#define GPIO_EIC_EXTINT4_2     (GPIO_FUNCC | GPIO_PORTA | GPIO_PIN19)
#define GPIO_EIC_EXTINT4_3     (GPIO_FUNCC | GPIO_PORTA | GPIO_PIN7)
#define GPIO_EIC_EXTINT5_1     (GPIO_FUNCB | GPIO_PORTC | GPIO_PIN3)
#define GPIO_EIC_EXTINT5_2     (GPIO_FUNCC | GPIO_PORTA | GPIO_PIN20)
#define GPIO_EIC_EXTINT6_1     (GPIO_FUNCB | GPIO_PORTC | GPIO_PIN4)
#define GPIO_EIC_EXTINT6_2     (GPIO_FUNCC | GPIO_PORTA | GPIO_PIN21)
#define GPIO_EIC_EXTINT7_1     (GPIO_FUNCB | GPIO_PORTC | GPIO_PIN5)
#define GPIO_EIC_EXTINT7_2     (GPIO_FUNCC | GPIO_PORTA | GPIO_PIN22)
#define GPIO_EIC_EXTINT8_1     (GPIO_FUNCB | GPIO_PORTC | GPIO_PIN6)
#define GPIO_EIC_EXTINT8_2     (GPIO_FUNCC | GPIO_PORTA | GPIO_PIN23)

/* Glue Logic Controller */

#define GPIO_GLOC_IN0_1        (GPIO_FUNCD | GPIO_PORTA | GPIO_PIN20)
#define GPIO_GLOC_IN0_2        (GPIO_FUNCD | GPIO_PORTA | GPIO_PIN6)
#define GPIO_GLOC_IN1_1        (GPIO_FUNCD | GPIO_PORTA | GPIO_PIN21)
#define GPIO_GLOC_IN1_2        (GPIO_FUNCD | GPIO_PORTA | GPIO_PIN4)
#define GPIO_GLOC_IN2_1        (GPIO_FUNCD | GPIO_PORTA | GPIO_PIN22)
#define GPIO_GLOC_IN2_2        (GPIO_FUNCD | GPIO_PORTA | GPIO_PIN5)
#define GPIO_GLOC_IN3_1        (GPIO_FUNCD | GPIO_PORTA | GPIO_PIN23)
#define GPIO_GLOC_IN3_2        (GPIO_FUNCD | GPIO_PORTA | GPIO_PIN7)
#define GPIO_GLOC_IN4_1        (GPIO_FUNCC | GPIO_PORTB | GPIO_PIN6)
#define GPIO_GLOC_IN4_2        (GPIO_FUNCC | GPIO_PORTC | GPIO_PIN28)
#define GPIO_GLOC_IN4_3        (GPIO_FUNCD | GPIO_PORTA | GPIO_PIN27)
#define GPIO_GLOC_IN4_4        (GPIO_FUNCD | GPIO_PORTC | GPIO_PIN15)
#define GPIO_GLOC_IN5_1        (GPIO_FUNCC | GPIO_PORTB | GPIO_PIN7)
#define GPIO_GLOC_IN5_2        (GPIO_FUNCC | GPIO_PORTC | GPIO_PIN29)
#define GPIO_GLOC_IN5_3        (GPIO_FUNCD | GPIO_PORTA | GPIO_PIN28)
#define GPIO_GLOC_IN5_4        (GPIO_FUNCD | GPIO_PORTC | GPIO_PIN16)
#define GPIO_GLOC_IN6_1        (GPIO_FUNCC | GPIO_PORTB | GPIO_PIN8)
#define GPIO_GLOC_IN6_2        (GPIO_FUNCC | GPIO_PORTC | GPIO_PIN30)
#define GPIO_GLOC_IN6_3        (GPIO_FUNCD | GPIO_PORTA | GPIO_PIN29)
#define GPIO_GLOC_IN6_4        (GPIO_FUNCD | GPIO_PORTC | GPIO_PIN17)
#define GPIO_GLOC_IN7_1        (GPIO_FUNCC | GPIO_PORTB | GPIO_PIN9)
#define GPIO_GLOC_IN7_2        (GPIO_FUNCD | GPIO_PORTA | GPIO_PIN30)
#define GPIO_GLOC_IN7_3        (GPIO_FUNCD | GPIO_PORTC | GPIO_PIN18)
#define GPIO_GLOC_OUT0_1       (GPIO_FUNCD | GPIO_PORTA | GPIO_PIN24)
#define GPIO_GLOC_OUT0_2       (GPIO_FUNCD | GPIO_PORTA | GPIO_PIN8)
#define GPIO_GLOC_OUT1_1       (GPIO_FUNCC | GPIO_PORTB | GPIO_PIN10)
#define GPIO_GLOC_OUT1_2       (GPIO_FUNCC | GPIO_PORTC | GPIO_PIN31)
#define GPIO_GLOC_OUT1_3       (GPIO_FUNCD | GPIO_PORTA | GPIO_PIN31)
#define GPIO_GLOC_OUT1_4       (GPIO_FUNCD | GPIO_PORTC | GPIO_PIN19)

/* Inter-IC Sound (I2S) Controller */

#define GPIO_IISC_IMCK_1       (GPIO_FUNCB | GPIO_PORTA | GPIO_PIN31)
#define GPIO_IISC_IMCK_2       (GPIO_FUNCD | GPIO_PORTB | GPIO_PIN5)
#define GPIO_IISC_IMCK_3       (GPIO_FUNCD | GPIO_PORTC | GPIO_PIN14)
#define GPIO_IISC_ISCK_1       (GPIO_FUNCB | GPIO_PORTA | GPIO_PIN27)
#define GPIO_IISC_ISCK_2       (GPIO_FUNCD | GPIO_PORTB | GPIO_PIN2)
#define GPIO_IISC_ISCK_3       (GPIO_FUNCD | GPIO_PORTC | GPIO_PIN9)
#define GPIO_IISC_ISDI_1       (GPIO_FUNCB | GPIO_PORTA | GPIO_PIN28)
#define GPIO_IISC_ISDI_2       (GPIO_FUNCD | GPIO_PORTB | GPIO_PIN3)
#define GPIO_IISC_ISDI_3       (GPIO_FUNCD | GPIO_PORTC | GPIO_PIN10)
#define GPIO_IISC_ISDO_1       (GPIO_FUNCB | GPIO_PORTA | GPIO_PIN30)
#define GPIO_IISC_ISDO_2       (GPIO_FUNCD | GPIO_PORTB | GPIO_PIN4)
#define GPIO_IISC_ISDO_3       (GPIO_FUNCD | GPIO_PORTC | GPIO_PIN13)
#define GPIO_IISC_IWS_1        (GPIO_FUNCB | GPIO_PORTA | GPIO_PIN29)
#define GPIO_IISC_IWS_2        (GPIO_FUNCD | GPIO_PORTB | GPIO_PIN6)
#define GPIO_IISC_IWS_3        (GPIO_FUNCD | GPIO_PORTC | GPIO_PIN12)

/* LCD Controller A */

#define GPIO_LCDCA_COM0        (GPIO_FUNCF | GPIO_PORTA | GPIO_PIN12)
#define GPIO_LCDCA_COM1        (GPIO_FUNCF | GPIO_PORTA | GPIO_PIN11)
#define GPIO_LCDCA_COM2        (GPIO_FUNCF | GPIO_PORTA | GPIO_PIN10)
#define GPIO_LCDCA_COM3        (GPIO_FUNCF | GPIO_PORTA | GPIO_PIN9)
#define GPIO_LCDCA_SEG0        (GPIO_FUNCF | GPIO_PORTC | GPIO_PIN15)
#define GPIO_LCDCA_SEG1        (GPIO_FUNCF | GPIO_PORTC | GPIO_PIN16)
#define GPIO_LCDCA_SEG2        (GPIO_FUNCF | GPIO_PORTC | GPIO_PIN17)
#define GPIO_LCDCA_SEG3        (GPIO_FUNCF | GPIO_PORTC | GPIO_PIN18)
#define GPIO_LCDCA_SEG4        (GPIO_FUNCF | GPIO_PORTC | GPIO_PIN19)
#define GPIO_LCDCA_SEG5        (GPIO_FUNCF | GPIO_PORTA | GPIO_PIN13)
#define GPIO_LCDCA_SEG6        (GPIO_FUNCF | GPIO_PORTA | GPIO_PIN14)
#define GPIO_LCDCA_SEG7        (GPIO_FUNCF | GPIO_PORTA | GPIO_PIN15)
#define GPIO_LCDCA_SEG8        (GPIO_FUNCF | GPIO_PORTA | GPIO_PIN16)
#define GPIO_LCDCA_SEG9        (GPIO_FUNCF | GPIO_PORTA | GPIO_PIN17)
#define GPIO_LCDCA_SEG10       (GPIO_FUNCF | GPIO_PORTC | GPIO_PIN20)
#define GPIO_LCDCA_SEG11       (GPIO_FUNCF | GPIO_PORTC | GPIO_PIN21)
#define GPIO_LCDCA_SEG12       (GPIO_FUNCF | GPIO_PORTC | GPIO_PIN22)
#define GPIO_LCDCA_SEG13       (GPIO_FUNCF | GPIO_PORTC | GPIO_PIN23)
#define GPIO_LCDCA_SEG14       (GPIO_FUNCF | GPIO_PORTB | GPIO_PIN8)
#define GPIO_LCDCA_SEG15       (GPIO_FUNCF | GPIO_PORTB | GPIO_PIN9)
#define GPIO_LCDCA_SEG16       (GPIO_FUNCF | GPIO_PORTB | GPIO_PIN10)
#define GPIO_LCDCA_SEG17       (GPIO_FUNCF | GPIO_PORTB | GPIO_PIN11)
#define GPIO_LCDCA_SEG18       (GPIO_FUNCF | GPIO_PORTA | GPIO_PIN18)
#define GPIO_LCDCA_SEG19       (GPIO_FUNCF | GPIO_PORTA | GPIO_PIN19)
#define GPIO_LCDCA_SEG20       (GPIO_FUNCF | GPIO_PORTA | GPIO_PIN20)
#define GPIO_LCDCA_SEG21       (GPIO_FUNCF | GPIO_PORTB | GPIO_PIN7)
#define GPIO_LCDCA_SEG22       (GPIO_FUNCF | GPIO_PORTB | GPIO_PIN6)
#define GPIO_LCDCA_SEG23       (GPIO_FUNCF | GPIO_PORTA | GPIO_PIN8)
#define GPIO_LCDCA_SEG24       (GPIO_FUNCF | GPIO_PORTC | GPIO_PIN24)
#define GPIO_LCDCA_SEG25       (GPIO_FUNCF | GPIO_PORTC | GPIO_PIN25)
#define GPIO_LCDCA_SEG26       (GPIO_FUNCF | GPIO_PORTC | GPIO_PIN26)
#define GPIO_LCDCA_SEG27       (GPIO_FUNCF | GPIO_PORTC | GPIO_PIN27)
#define GPIO_LCDCA_SEG28       (GPIO_FUNCF | GPIO_PORTC | GPIO_PIN28)
#define GPIO_LCDCA_SEG29       (GPIO_FUNCF | GPIO_PORTC | GPIO_PIN29)
#define GPIO_LCDCA_SEG30       (GPIO_FUNCF | GPIO_PORTC | GPIO_PIN30)
#define GPIO_LCDCA_SEG31       (GPIO_FUNCF | GPIO_PORTC | GPIO_PIN31)
#define GPIO_LCDCA_SEG32       (GPIO_FUNCF | GPIO_PORTB | GPIO_PIN12)
#define GPIO_LCDCA_SEG33       (GPIO_FUNCF | GPIO_PORTB | GPIO_PIN13)
#define GPIO_LCDCA_SEG34       (GPIO_FUNCF | GPIO_PORTA | GPIO_PIN21)
#define GPIO_LCDCA_SEG35       (GPIO_FUNCF | GPIO_PORTA | GPIO_PIN22)
#define GPIO_LCDCA_SEG36       (GPIO_FUNCF | GPIO_PORTB | GPIO_PIN14)
#define GPIO_LCDCA_SEG37       (GPIO_FUNCF | GPIO_PORTB | GPIO_PIN15)
#define GPIO_LCDCA_SEG38       (GPIO_FUNCF | GPIO_PORTA | GPIO_PIN23)
#define GPIO_LCDCA_SEG39       (GPIO_FUNCF | GPIO_PORTA | GPIO_PIN24)

/* Parallel Capture */

#define GPIO_PARC_PCCK_1       (GPIO_FUNCD | GPIO_PORTA | GPIO_PIN17)
#define GPIO_PARC_PCCK_2       (GPIO_FUNCD | GPIO_PORTC | GPIO_PIN21)
#define GPIO_PARC_PCDATA0_1    (GPIO_FUNCD | GPIO_PORTA | GPIO_PIN9)
#define GPIO_PARC_PCDATA0_2    (GPIO_FUNCD | GPIO_PORTC | GPIO_PIN24)
#define GPIO_PARC_PCDATA1_1    (GPIO_FUNCD | GPIO_PORTA | GPIO_PIN10)
#define GPIO_PARC_PCDATA1_2    (GPIO_FUNCD | GPIO_PORTC | GPIO_PIN25)
#define GPIO_PARC_PCDATA2_1    (GPIO_FUNCD | GPIO_PORTA | GPIO_PIN11)
#define GPIO_PARC_PCDATA2_2    (GPIO_FUNCD | GPIO_PORTC | GPIO_PIN26)
#define GPIO_PARC_PCDATA3_1    (GPIO_FUNCD | GPIO_PORTA | GPIO_PIN12)
#define GPIO_PARC_PCDATA3_2    (GPIO_FUNCD | GPIO_PORTC | GPIO_PIN27)
#define GPIO_PARC_PCDATA4_1    (GPIO_FUNCD | GPIO_PORTA | GPIO_PIN13)
#define GPIO_PARC_PCDATA4_2    (GPIO_FUNCD | GPIO_PORTC | GPIO_PIN28)
#define GPIO_PARC_PCDATA5_1    (GPIO_FUNCD | GPIO_PORTA | GPIO_PIN14)
#define GPIO_PARC_PCDATA5_2    (GPIO_FUNCD | GPIO_PORTC | GPIO_PIN29)
#define GPIO_PARC_PCDATA6_1    (GPIO_FUNCD | GPIO_PORTA | GPIO_PIN15)
#define GPIO_PARC_PCDATA6_2    (GPIO_FUNCD | GPIO_PORTC | GPIO_PIN30)
#define GPIO_PARC_PCDATA7_1    (GPIO_FUNCD | GPIO_PORTA | GPIO_PIN16)
#define GPIO_PARC_PCDATA7_2    (GPIO_FUNCD | GPIO_PORTC | GPIO_PIN31)
#define GPIO_PARC_PCEN1_1      (GPIO_FUNCD | GPIO_PORTA | GPIO_PIN18)
#define GPIO_PARC_PCEN1_2      (GPIO_FUNCD | GPIO_PORTC | GPIO_PIN22)
#define GPIO_PARC_PCEN2_1      (GPIO_FUNCD | GPIO_PORTA | GPIO_PIN19)
#define GPIO_PARC_PCEN2_2      (GPIO_FUNCD | GPIO_PORTC | GPIO_PIN23)

/* Peripheral Event Controller */

#define GPIO_PEVC_PAD_EVT0_1   (GPIO_FUNCC | GPIO_PORTA | GPIO_PIN8)
#define GPIO_PEVC_PAD_EVT0_2   (GPIO_FUNCC | GPIO_PORTB | GPIO_PIN12)
#define GPIO_PEVC_PAD_EVT0_3   (GPIO_FUNCC | GPIO_PORTC | GPIO_PIN24)
#define GPIO_PEVC_PAD_EVT0_4   (GPIO_FUNCC | GPIO_PORTC | GPIO_PIN7)
#define GPIO_PEVC_PAD_EVT1_1   (GPIO_FUNCC | GPIO_PORTA | GPIO_PIN9)
#define GPIO_PEVC_PAD_EVT1_2   (GPIO_FUNCC | GPIO_PORTB | GPIO_PIN13)
#define GPIO_PEVC_PAD_EVT1_3   (GPIO_FUNCC | GPIO_PORTC | GPIO_PIN25)
#define GPIO_PEVC_PAD_EVT1_4   (GPIO_FUNCC | GPIO_PORTC | GPIO_PIN8)
#define GPIO_PEVC_PAD_EVT2_1   (GPIO_FUNCB | GPIO_PORTB | GPIO_PIN9)
#define GPIO_PEVC_PAD_EVT2_2   (GPIO_FUNCC | GPIO_PORTA | GPIO_PIN10)
#define GPIO_PEVC_PAD_EVT2_3   (GPIO_FUNCC | GPIO_PORTC | GPIO_PIN11)
#define GPIO_PEVC_PAD_EVT2_4   (GPIO_FUNCC | GPIO_PORTC | GPIO_PIN26)
#define GPIO_PEVC_PAD_EVT3_1   (GPIO_FUNCB | GPIO_PORTB | GPIO_PIN10)
#define GPIO_PEVC_PAD_EVT3_2   (GPIO_FUNCC | GPIO_PORTA | GPIO_PIN11)
#define GPIO_PEVC_PAD_EVT3_3   (GPIO_FUNCC | GPIO_PORTC | GPIO_PIN27)

/* System Control Interface */

#define GPIO_SCIF_GCLK0_1      (GPIO_FUNCA | GPIO_PORTA | GPIO_PIN2)
#define GPIO_SCIF_GCLK0_2      (GPIO_FUNCE | GPIO_PORTA | GPIO_PIN19)
#define GPIO_SCIF_GCLK0_3      (GPIO_FUNCE | GPIO_PORTB | GPIO_PIN10)
#define GPIO_SCIF_GCLK0_4      (GPIO_FUNCE | GPIO_PORTC | GPIO_PIN26)
#define GPIO_SCIF_GCLK1_1      (GPIO_FUNCE | GPIO_PORTA | GPIO_PIN20)
#define GPIO_SCIF_GCLK1_2      (GPIO_FUNCE | GPIO_PORTB | GPIO_PIN11)
#define GPIO_SCIF_GCLK1_3      (GPIO_FUNCE | GPIO_PORTC | GPIO_PIN27)
#define GPIO_SCIF_GCLK2_1      (GPIO_FUNCE | GPIO_PORTB | GPIO_PIN12)
#define GPIO_SCIF_GCLK2_2      (GPIO_FUNCE | GPIO_PORTC | GPIO_PIN28)
#define GPIO_SCIF_GCLK3_1      (GPIO_FUNCE | GPIO_PORTB | GPIO_PIN13)
#define GPIO_SCIF_GCLK3_2      (GPIO_FUNCE | GPIO_PORTC | GPIO_PIN29)
#define GPIO_SCIF_GCLK_IN0_1   (GPIO_FUNCE | GPIO_PORTA | GPIO_PIN23)
#define GPIO_SCIF_GCLK_IN0_2   (GPIO_FUNCE | GPIO_PORTB | GPIO_PIN14)
#define GPIO_SCIF_GCLK_IN0_3   (GPIO_FUNCE | GPIO_PORTC | GPIO_PIN30)
#define GPIO_SCIF_GCLK_IN1_1   (GPIO_FUNCE | GPIO_PORTA | GPIO_PIN24)
#define GPIO_SCIF_GCLK_IN1_2   (GPIO_FUNCE | GPIO_PORTB | GPIO_PIN15)
#define GPIO_SCIF_GCLK_IN1_3   (GPIO_FUNCE | GPIO_PORTC | GPIO_PIN31)

/* Serial Peripheral Interface */

#define GPIO_SPI0_MISO_1       (GPIO_FUNCA | GPIO_PORTA | GPIO_PIN21)
#define GPIO_SPI0_MISO_2       (GPIO_FUNCA | GPIO_PORTA | GPIO_PIN27)
#define GPIO_SPI0_MISO_3       (GPIO_FUNCA | GPIO_PORTC | GPIO_PIN4)
#define GPIO_SPI0_MISO_4       (GPIO_FUNCB | GPIO_PORTA | GPIO_PIN3)
#define GPIO_SPI0_MISO_5       (GPIO_FUNCB | GPIO_PORTB | GPIO_PIN14)
#define GPIO_SPI0_MISO_6       (GPIO_FUNCB | GPIO_PORTC | GPIO_PIN28)
#define GPIO_SPI0_MOSI_1       (GPIO_FUNCA | GPIO_PORTA | GPIO_PIN22)
#define GPIO_SPI0_MOSI_2       (GPIO_FUNCA | GPIO_PORTA | GPIO_PIN28)
#define GPIO_SPI0_MOSI_3       (GPIO_FUNCA | GPIO_PORTC | GPIO_PIN5)
#define GPIO_SPI0_MOSI_4       (GPIO_FUNCB | GPIO_PORTB | GPIO_PIN15)
#define GPIO_SPI0_MOSI_5       (GPIO_FUNCB | GPIO_PORTC | GPIO_PIN29)
#define GPIO_SPI0_NPCS0_1      (GPIO_FUNCA | GPIO_PORTA | GPIO_PIN24)
#define GPIO_SPI0_NPCS0_2      (GPIO_FUNCA | GPIO_PORTA | GPIO_PIN30)
#define GPIO_SPI0_NPCS0_3      (GPIO_FUNCA | GPIO_PORTC | GPIO_PIN3)
#define GPIO_SPI0_NPCS0_4      (GPIO_FUNCB | GPIO_PORTA | GPIO_PIN2)
#define GPIO_SPI0_NPCS0_5      (GPIO_FUNCB | GPIO_PORTC | GPIO_PIN31)
#define GPIO_SPI0_NPCS1_1      (GPIO_FUNCA | GPIO_PORTA | GPIO_PIN31)
#define GPIO_SPI0_NPCS1_2      (GPIO_FUNCA | GPIO_PORTC | GPIO_PIN2)
#define GPIO_SPI0_NPCS1_3      (GPIO_FUNCB | GPIO_PORTB | GPIO_PIN13)
#define GPIO_SPI0_NPCS1_4      (GPIO_FUNCC | GPIO_PORTA | GPIO_PIN13)
#define GPIO_SPI0_NPCS2_1      (GPIO_FUNCA | GPIO_PORTC | GPIO_PIN0)
#define GPIO_SPI0_NPCS2_2      (GPIO_FUNCB | GPIO_PORTB | GPIO_PIN11)
#define GPIO_SPI0_NPCS2_3      (GPIO_FUNCC | GPIO_PORTA | GPIO_PIN14)
#define GPIO_SPI0_NPCS3_1      (GPIO_FUNCA | GPIO_PORTC | GPIO_PIN1)
#define GPIO_SPI0_NPCS3_2      (GPIO_FUNCB | GPIO_PORTB | GPIO_PIN12)
#define GPIO_SPI0_NPCS3_3      (GPIO_FUNCC | GPIO_PORTA | GPIO_PIN15)
#define GPIO_SPI0_SPCK_1       (GPIO_FUNCA | GPIO_PORTA | GPIO_PIN23)
#define GPIO_SPI0_SPCK_2       (GPIO_FUNCA | GPIO_PORTA | GPIO_PIN29)
#define GPIO_SPI0_SPCK_3       (GPIO_FUNCA | GPIO_PORTC | GPIO_PIN6)
#define GPIO_SPI0_SPCK_4       (GPIO_FUNCB | GPIO_PORTC | GPIO_PIN30)

