apache/nuttx/arch/arm/src/sam34/hardware/sam4l_pinmap.h
/* Timer/Counters */

#define GPIO_TC0_A0_1          (GPIO_FUNCB | GPIO_PORTA | GPIO_PIN8)
#define GPIO_TC0_A0_2          (GPIO_FUNCD | GPIO_PORTB | GPIO_PIN7)
#define GPIO_TC0_A1_1          (GPIO_FUNCB | GPIO_PORTA | GPIO_PIN10)
#define GPIO_TC0_A1_2          (GPIO_FUNCD | GPIO_PORTB | GPIO_PIN9)
#define GPIO_TC0_A2_1          (GPIO_FUNCB | GPIO_PORTA | GPIO_PIN12)
#define GPIO_TC0_A2_2          (GPIO_FUNCD | GPIO_PORTB | GPIO_PIN11)
#define GPIO_TC0_B0_1          (GPIO_FUNCB | GPIO_PORTA | GPIO_PIN9)
#define GPIO_TC0_B0_2          (GPIO_FUNCD | GPIO_PORTB | GPIO_PIN8)
#define GPIO_TC0_B1_1          (GPIO_FUNCB | GPIO_PORTA | GPIO_PIN11)
#define GPIO_TC0_B1_2          (GPIO_FUNCD | GPIO_PORTB | GPIO_PIN10)
#define GPIO_TC0_B2_1          (GPIO_FUNCB | GPIO_PORTA | GPIO_PIN13)
#define GPIO_TC0_B2_2          (GPIO_FUNCD | GPIO_PORTB | GPIO_PIN12)
#define GPIO_TC0_CLK0_1        (GPIO_FUNCB | GPIO_PORTA | GPIO_PIN14)
#define GPIO_TC0_CLK0_2        (GPIO_FUNCD | GPIO_PORTB | GPIO_PIN13)
#define GPIO_TC0_CLK1_1        (GPIO_FUNCB | GPIO_PORTA | GPIO_PIN15)
#define GPIO_TC0_CLK1_2        (GPIO_FUNCD | GPIO_PORTB | GPIO_PIN14)
#define GPIO_TC0_CLK2_1        (GPIO_FUNCB | GPIO_PORTA | GPIO_PIN16)
#define GPIO_TC0_CLK2_2        (GPIO_FUNCD | GPIO_PORTB | GPIO_PIN15)

#define GPIO_TC1_A0_1          (GPIO_FUNCA | GPIO_PORTC | GPIO_PIN15)
#define GPIO_TC1_A0_2          (GPIO_FUNCD | GPIO_PORTC | GPIO_PIN0)
#define GPIO_TC1_A1_1          (GPIO_FUNCA | GPIO_PORTC | GPIO_PIN17)
#define GPIO_TC1_A1_2          (GPIO_FUNCD | GPIO_PORTC | GPIO_PIN2)
#define GPIO_TC1_A2_1          (GPIO_FUNCA | GPIO_PORTC | GPIO_PIN19)
#define GPIO_TC1_A2_2          (GPIO_FUNCD | GPIO_PORTC | GPIO_PIN4)
#define GPIO_TC1_B0_1          (GPIO_FUNCA | GPIO_PORTC | GPIO_PIN16)
#define GPIO_TC1_B0_2          (GPIO_FUNCD | GPIO_PORTC | GPIO_PIN1)
#define GPIO_TC1_B1_1          (GPIO_FUNCA | GPIO_PORTC | GPIO_PIN18)
#define GPIO_TC1_B1_2          (GPIO_FUNCD | GPIO_PORTC | GPIO_PIN3)
#define GPIO_TC1_B2_1          (GPIO_FUNCA | GPIO_PORTC | GPIO_PIN20)
#define GPIO_TC1_B2_2          (GPIO_FUNCD | GPIO_PORTC | GPIO_PIN5)
#define GPIO_TC1_CLK0_1        (GPIO_FUNCA | GPIO_PORTC | GPIO_PIN21)
#define GPIO_TC1_CLK0_2        (GPIO_FUNCD | GPIO_PORTC | GPIO_PIN6)
#define GPIO_TC1_CLK1_1        (GPIO_FUNCA | GPIO_PORTC | GPIO_PIN22)
#define GPIO_TC1_CLK1_2        (GPIO_FUNCD | GPIO_PORTC | GPIO_PIN7)
#define GPIO_TC1_CLK2_1        (GPIO_FUNCA | GPIO_PORTC | GPIO_PIN23)
#define GPIO_TC1_CLK2_2        (GPIO_FUNCD | GPIO_PORTC | GPIO_PIN8)

/* Two-wire Master Interface */

#define GPIO_TWIM2_TWCK      (GPIO_FUNCE | GPIO_PORTA | GPIO_PIN22)
#define GPIO_TWIM2_TWD       (GPIO_FUNCE | GPIO_PORTA | GPIO_PIN21)
#define GPIO_TWIM3_TWCK      (GPIO_FUNCC | GPIO_PORTB | GPIO_PIN15)
#define GPIO_TWIM3_TWD       (GPIO_FUNCC | GPIO_PORTB | GPIO_PIN14)
#define GPIO_TWIMS0_TWCK     (GPIO_FUNCB | GPIO_PORTA | GPIO_PIN24)
#define GPIO_TWIMS0_TWD      (GPIO_FUNCB | GPIO_PORTA | GPIO_PIN23)
#define GPIO_TWIMS1_TWCK     (GPIO_FUNCA | GPIO_PORTB | GPIO_PIN1)
#define GPIO_TWIMS1_TWD      (GPIO_FUNCA | GPIO_PORTB | GPIO_PIN0)

/* USARTs */

#define GPIO_USART0_CLK_1      (GPIO_FUNCA | GPIO_PORTA | GPIO_PIN10)
#define GPIO_USART0_CLK_2      (GPIO_FUNCA | GPIO_PORTB | GPIO_PIN13)
#define GPIO_USART0_CLK_3      (GPIO_FUNCB | GPIO_PORTA | GPIO_PIN4)
#define GPIO_USART0_CLK_4      (GPIO_FUNCB | GPIO_PORTC | GPIO_PIN0)
#define GPIO_USART0_CTS_1      (GPIO_FUNCA | GPIO_PORTA | GPIO_PIN9)
#define GPIO_USART0_CTS_2      (GPIO_FUNCA | GPIO_PORTB | GPIO_PIN11)
#define GPIO_USART0_CTS_3      (GPIO_FUNCB | GPIO_PORTC | GPIO_PIN2)
#define GPIO_USART0_RTS_1      (GPIO_FUNCA | GPIO_PORTA | GPIO_PIN8)
#define GPIO_USART0_RTS_2      (GPIO_FUNCA | GPIO_PORTB | GPIO_PIN12)
#define GPIO_USART0_RTS_3      (GPIO_FUNCB | GPIO_PORTA | GPIO_PIN6)
#define GPIO_USART0_RTS_4      (GPIO_FUNCB | GPIO_PORTC | GPIO_PIN1)
#define GPIO_USART0_RXD_1      (GPIO_FUNCA | GPIO_PORTA | GPIO_PIN11)
#define GPIO_USART0_RXD_2      (GPIO_FUNCA | GPIO_PORTB | GPIO_PIN14)
#define GPIO_USART0_RXD_3      (GPIO_FUNCB | GPIO_PORTA | GPIO_PIN5)
#define GPIO_USART0_RXD_4      (GPIO_FUNCB | GPIO_PORTB | GPIO_PIN0)
#define GPIO_USART0_RXD_5      (GPIO_FUNCC | GPIO_PORTC | GPIO_PIN2)
#define GPIO_USART0_TXD_1      (GPIO_FUNCA | GPIO_PORTA | GPIO_PIN12)
#define GPIO_USART0_TXD_2      (GPIO_FUNCA | GPIO_PORTB | GPIO_PIN15)
#define GPIO_USART0_TXD_3      (GPIO_FUNCB | GPIO_PORTA | GPIO_PIN7)
#define GPIO_USART0_TXD_4      (GPIO_FUNCB | GPIO_PORTB | GPIO_PIN1)
#define GPIO_USART0_TXD_5      (GPIO_FUNCC | GPIO_PORTC | GPIO_PIN3)

#define GPIO_USART1_CLK_1      (GPIO_FUNCA | GPIO_PORTA | GPIO_PIN14)
#define GPIO_USART1_CLK_2      (GPIO_FUNCA | GPIO_PORTC | GPIO_PIN25)
#define GPIO_USART1_CLK_3      (GPIO_FUNCB | GPIO_PORTB | GPIO_PIN3)
#define GPIO_USART1_CTS        (GPIO_FUNCB | GPIO_PORTA | GPIO_PIN21)
#define GPIO_USART1_RTS_1      (GPIO_FUNCA | GPIO_PORTA | GPIO_PIN13)
#define GPIO_USART1_RTS_2      (GPIO_FUNCA | GPIO_PORTC | GPIO_PIN24)
#define GPIO_USART1_RTS_3      (GPIO_FUNCB | GPIO_PORTB | GPIO_PIN2)
#define GPIO_USART1_RXD_1      (GPIO_FUNCA | GPIO_PORTA | GPIO_PIN15)
#define GPIO_USART1_RXD_2      (GPIO_FUNCA | GPIO_PORTC | GPIO_PIN26)
#define GPIO_USART1_RXD_3      (GPIO_FUNCB | GPIO_PORTB | GPIO_PIN4)
#define GPIO_USART1_TXD_1      (GPIO_FUNCA | GPIO_PORTA | GPIO_PIN16)
#define GPIO_USART1_TXD_2      (GPIO_FUNCA | GPIO_PORTC | GPIO_PIN27)
#define GPIO_USART1_TXD_3      (GPIO_FUNCB | GPIO_PORTB | GPIO_PIN5)

#define GPIO_USART2_CLK_1      (GPIO_FUNCA | GPIO_PORTA | GPIO_PIN18)
#define GPIO_USART2_CLK_2      (GPIO_FUNCB | GPIO_PORTC | GPIO_PIN8)
#define GPIO_USART2_CTS_1      (GPIO_FUNCB | GPIO_PORTA | GPIO_PIN22)
#define GPIO_USART2_CTS_2      (GPIO_FUNCE | GPIO_PORTC | GPIO_PIN8)
#define GPIO_USART2_RTS_1      (GPIO_FUNCA | GPIO_PORTA | GPIO_PIN17)
#define GPIO_USART2_RTS_2      (GPIO_FUNCB | GPIO_PORTC | GPIO_PIN7)
#define GPIO_USART2_RXD_1      (GPIO_FUNCA | GPIO_PORTA | GPIO_PIN19)
#define GPIO_USART2_RXD_2      (GPIO_FUNCB | GPIO_PORTA | GPIO_PIN25)
#define GPIO_USART2_RXD_3      (GPIO_FUNCB | GPIO_PORTC | GPIO_PIN11)
#define GPIO_USART2_TXD_1      (GPIO_FUNCA | GPIO_PORTA | GPIO_PIN20)
#define GPIO_USART2_TXD_2      (GPIO_FUNCB | GPIO_PORTA | GPIO_PIN26)
#define GPIO_USART2_TXD_3      (GPIO_FUNCB | GPIO_PORTC | GPIO_PIN12)

#define GPIO_USART3_CLK_1      (GPIO_FUNCA | GPIO_PORTB | GPIO_PIN8)
#define GPIO_USART3_CLK_2      (GPIO_FUNCA | GPIO_PORTC | GPIO_PIN31)
#define GPIO_USART3_CLK_3      (GPIO_FUNCB | GPIO_PORTC | GPIO_PIN14)
#define GPIO_USART3_CLK_4      (GPIO_FUNCE | GPIO_PORTA | GPIO_PIN29)
#define GPIO_USART3_CTS_1      (GPIO_FUNCA | GPIO_PORTB | GPIO_PIN7)
#define GPIO_USART3_CTS_2      (GPIO_FUNCE | GPIO_PORTA | GPIO_PIN28)
#define GPIO_USART3_RTS_1      (GPIO_FUNCA | GPIO_PORTB | GPIO_PIN6)
#define GPIO_USART3_RTS_2      (GPIO_FUNCA | GPIO_PORTC | GPIO_PIN30)
#define GPIO_USART3_RTS_3      (GPIO_FUNCB | GPIO_PORTC | GPIO_PIN13)
#define GPIO_USART3_RTS_4      (GPIO_FUNCE | GPIO_PORTA | GPIO_PIN27)
#define GPIO_USART3_RXD_1      (GPIO_FUNCA | GPIO_PORTB | GPIO_PIN9)
#define GPIO_USART3_RXD_2      (GPIO_FUNCA | GPIO_PORTC | GPIO_PIN28)
#define GPIO_USART3_RXD_3      (GPIO_FUNCB | GPIO_PORTC | GPIO_PIN9)
#define GPIO_USART3_RXD_4      (GPIO_FUNCE | GPIO_PORTA | GPIO_PIN30)
#define GPIO_USART3_TXD_1      (GPIO_FUNCA | GPIO_PORTB | GPIO_PIN10)
#define GPIO_USART3_TXD_2      (GPIO_FUNCA | GPIO_PORTC | GPIO_PIN29)
#define GPIO_USART3_TXD_3      (GPIO_FUNCB | GPIO_PORTC | GPIO_PIN10)
#define GPIO_USART3_TXD_4      (GPIO_FUNCE | GPIO_PORTA | GPIO_PIN31)

/* USB 2.0 Interface */

#define GPIO_USBC_DM           (GPIO_FUNCA | GPIO_PORTA | GPIO_PIN25)
#define GPIO_USBC_DP           (GPIO_FUNCA | GPIO_PORTA | GPIO_PIN26)

/************************************************************************************
 * Public Types
 ************************************************************************************/

/************************************************************************************
 * Inline Functions
 ************************************************************************************/

#ifndef __ASSEMBLY__

/************************************************************************************
 * Public Data
 ************************************************************************************/

#undef EXTERN
#if defined(__cplusplus)
#define EXTERN extern "C"
extern "C"
{
#else
#define EXTERN extern
#endif

/************************************************************************************
 * Public Function Prototypes
 ************************************************************************************/

#undef EXTERN
#if defined(__cplusplus)
}
#endif

#endif /* __ASSEMBLY__ */
#endif /* __ARCH_ARM_SRC_SAM34_HARDWARE_SAM3U_PINMAP_H */
